# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
# Your code here
import sqlite3
import pandas as pd
import numpy as np
con = sqlite3.connect('data.sqlite')

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [34]:
# Your code here
pd.read_sql_query('''
SELECT *
FROM employees
JOIN offices
USING (officeCode)
WHERE city = 'Boston'
''', con).head(3)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143,Sales Rep,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
1,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143,Sales Rep,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [33]:
# Your code here
pd.read_sql_query('''
SELECT COUNT(employeeNumber), offices.*
FROM offices
LEFT JOIN employees
USING (officeCode)
GROUP BY officeCode
Having COUNT(employeeNumber)=0
''', con)

,COUNT(employeeNumber),officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,0,27,Boston,+1 977 299 8345,105 Cambridge Street,,MA,USA,02331,NA

## Write 3 Questions of your own and answer them

In [3]:
# Answers will vary
# Example: Display the htmlDescription and 
# employee's first and last name for each product that each employee has sold
pd.read_sql_query('''
SELECT pl.htmlDescription, p.productName, e.firstName, e.lastName
FROM employees e
JOIN customers c
ON e.employeeNumber = c.SalesRepEmployeeNumber
JOIN orders o
ON o.customerNumber = c.customerNumber
JOIN orderdetails d
ON d.orderNumber = o.orderNumber
JOIN products p
ON p.productCode = d.productCode
JOIN productlines pl
ON pl.productLine = p.productLine
''', con)

,htmlDescription,productName,firstName,lastName
0,,1958 Setra Bus,Leslie,Jennings
1,,1940 Ford Pickup Truck,Leslie,Jennings
2,,1939 Cadillac Limousine,Leslie,Jennings
3,,1996 Peterbilt 379 Stake Bed with Outrigger,Leslie,Jennings
4,,1968 Ford Mustang,Leslie,Jennings
...,...,...,...,...
2991,,1954 Greyhound Scenicruiser,Martin,Gerard
2992,,1950's Chicago Surface Lines Streetcar,Martin,Gerard
2993,,Diamond T620 Semi-Skirted Tanker,Martin,Gerard
2994,,1911 Ford Town Car,Martin,Gerard
2995,,1936 Mercedes Benz 500k Roadster,Martin,Gerard

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [11]:
# Your code here
df = pd.read_sql_query('''
SELECT e.firstName || ', ' || e.lastName AS name, p.productName
FROM employees e
JOIN customers c
ON e.employeeNumber = c.SalesRepEmployeeNumber
JOIN orders o
ON o.customerNumber = c.customerNumber
JOIN orderdetails d
ON d.orderNumber = o.orderNumber
JOIN products p
ON p.productCode = d.productCode
''', con)

In [ ]:
df.groupby

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!